## Staging: alarms
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 16 to add, 0 to change, 17 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                              NAME                                               |
|----------|-------------------------------------------------------------------------------------------------|
| add      | `aws_cloudwatch_log_group.notify_slack`                                                         |
|          | `aws_cloudwatch_log_subscription_filter.archiver_log_stream`                                    |
|          | `aws_cloudwatch_log_subscription_filter.audit_log_stream`                                       |
|          | `aws_cloudwatch_log_subscription_filter.dlq_consumer_log_stream`                                |
|          | `aws_cloudwatch_log_subscription_filter.forms_app_log_stream`                                   |
|          | `aws_cloudwatch_log_subscription_filter.forms_unhandled_error_steam`                            |
|          | `aws_cloudwatch_log_subscription_filter.nagware_log_stream`                                     |
|          | `aws_cloudwatch_log_subscription_filter.reliability_log_stream`                                 |
|          | `aws_cloudwatch_log_subscription_filter.template_archiver_log_stream`                           |
|          | `aws_lambda_function.notify_slack`                                                              |
|          | `aws_lambda_permission.allow_cloudwatch_to_run_lambda`                                          |
| delete   | `aws_cloudwatch_log_metric_filter.application_error`                                            |
|          | `aws_cloudwatch_log_metric_filter.expired_bearer_token`                                         |
|          | `aws_cloudwatch_log_metric_filter.five_hundred_response`                                        |
|          | `aws_cloudwatch_log_metric_filter.generate_temporary_token_api_failure`                         |
|          | `aws_cloudwatch_log_metric_filter.request_temporary_token_api_using_unauthorized_email_address` |
|          | `aws_cloudwatch_metric_alarm.application_error_warn`                                            |
|          | `aws_cloudwatch_metric_alarm.expired_bearer_token`                                              |
|          | `aws_cloudwatch_metric_alarm.five_hundred_response_warn`                                        |
|          | `aws_cloudwatch_metric_alarm.generate_temporary_token_api_failure`                              |
|          | `aws_cloudwatch_metric_alarm.request_temporary_token_api_using_unauthorized_email_address`      |
|          | `aws_cloudwatch_metric_alarm.temporary_token_generated_outside_canada_warn`                     |
|          | `aws_lambda_function.notify_slack_sns`                                                          |
| recreate | `aws_sns_topic_subscription.topic_critical`                                                     |
|          | `aws_sns_topic_subscription.topic_ok`                                                           |
|          | `aws_sns_topic_subscription.topic_ok_us_east`                                                   |
|          | `aws_sns_topic_subscription.topic_warning`                                                      |
|          | `aws_sns_topic_subscription.topic_warning_us_east`                                              |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.notify_slack will be created
  + resource "aws_cloudwatch_log_group" "notify_slack" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = "arn:aws:kms:ca-central-1:687401027353:key/c5c2a1c2-c092-4fa1-8daf-3414f3511b1d"
      + name              = "/aws/lambda/NotifySlackSNS"
      + retention_in_days = 90
      + tags_all          = (known after apply)
    }

  # aws_cloudwatch_log_metric_filter.application_error will be destroyed
  # (because aws_cloudwatch_log_metric_filter.application_error is not in configuration)
  - resource "aws_cloudwatch_log_metric_filter" "application_error" {
      - id             = "ApplicationError" -> null
      - log_group_name = "Forms" -> null
      - name           = "ApplicationError" -> null
      - pattern        = "Error" -> null

      - metric_transformation {
          - default_value = "0" -> null
          - dimensions    = {} -> null
          - name          = "ApplicationError" -> null
          - namespace     = "forms" -> null
          - unit          = "None" -> null
          - value         = "1" -> null
        }
    }

  # aws_cloudwatch_log_metric_filter.expired_bearer_token will be destroyed
  # (because aws_cloudwatch_log_metric_filter.expired_bearer_token is not in configuration)
  - resource "aws_cloudwatch_log_metric_filter" "expired_bearer_token" {
      - id             = "ExpiredBearerToken" -> null
      - log_group_name = "Forms" -> null
      - name           = "ExpiredBearerToken" -> null
      - pattern        = "expired bearer token" -> null

      - metric_transformation {
          - dimensions = {} -> null
          - name       = "ExpiredBearerToken" -> null
          - namespace  = "forms" -> null
          - unit       = "None" -> null
          - value      = "1" -> null
        }
    }

  # aws_cloudwatch_log_metric_filter.five_hundred_response will be destroyed
  # (because aws_cloudwatch_log_metric_filter.five_hundred_response is not in configuration)
  - resource "aws_cloudwatch_log_metric_filter" "five_hundred_response" {
      - id             = "500Response" -> null
      - log_group_name = "Forms" -> null
      - name           = "500Response" -> null
      - pattern        = "\"HTTP/1.1 5\"" -> null

      - metric_transformation {
          - default_value = "0" -> null
          - dimensions    = {} -> null
          - name          = "500Response" -> null
          - namespace     = "forms" -> null
          - unit          = "None" -> null
          - value         = "1" -> null
        }
    }

  # aws_cloudwatch_log_metric_filter.generate_temporary_token_api_failure will be destroyed
  # (because aws_cloudwatch_log_metric_filter.generate_temporary_token_api_failure is not in configuration)
  - resource "aws_cloudwatch_log_metric_filter" "generate_temporary_token_api_failure" {
      - id             = "GenerateTemporaryTokenApiFailure" -> null
      - log_group_name = "Forms" -> null
      - name           = "GenerateTemporaryTokenApiFailure" -> null
      - pattern        = "Failed to generate temporary token" -> null

      - metric_transformation {
          - dimensions = {} -> null
          - name       = "GenerateTemporaryTokenApiFailure" -> null
          - namespace  = "forms" -> null
          - unit       = "None" -> null
          - value      = "1" -> null
        }
    }

  # aws_cloudwatch_log_metric_filter.request_temporary_token_api_using_unauthorized_email_address will be destroyed
  # (because aws_cloudwatch_log_metric_filter.request_temporary_token_api_using_unauthorized_email_address is not in configuration)
  - resource "aws_cloudwatch_log_metric_filter" "request_temporary_token_api_using_unauthorized_email_address" {
      - id             = "RequestTemporaryTokenApiUsingUnauthorizedEmailAddress" -> null
      - log_group_name = "Forms" -> null
      - name           = "RequestTemporaryTokenApiUsingUnauthorizedEmailAddress" -> null
      - pattern        = "\"An email address with no access to any form has been locked out\"" -> null

      - metric_transformation {
          - dimensions = {} -> null
          - name       = "RequestTemporaryTokenApiUsingUnauthorizedEmailAddress" -> null
          - namespace  = "forms" -> null
          - unit       = "None" -> null
          - value      = "1" -> null
        }
    }

  # aws_cloudwatch_log_subscription_filter.archiver_log_stream will be created
  + resource "aws_cloudwatch_log_subscription_filter" "archiver_log_stream" {
      + destination_arn = (known after apply)
      + distribution    = "ByLogStream"
      + filter_pattern  = "{($.level = \"warn\") || ($.level = \"error\")}"
      + id              = (known after apply)
      + name            = "archiver_log_stream"
      + role_arn        = (known after apply)
    }

  # aws_cloudwatch_log_subscription_filter.audit_log_stream will be created
  + resource "aws_cloudwatch_log_subscription_filter" "audit_log_stream" {
      + destination_arn = (known after apply)
      + distribution    = "ByLogStream"
      + filter_pattern  = "{($.level = \"warn\") || ($.level = \"error\")}"
      + id              = (known after apply)
      + name            = "audit_log_stream"
      + role_arn        = (known after apply)
    }

  # aws_cloudwatch_log_subscription_filter.dlq_consumer_log_stream will be created
  + resource "aws_cloudwatch_log_subscription_filter" "dlq_consumer_log_stream" {
      + destination_arn = (known after apply)
      + distribution    = "ByLogStream"
      + filter_pattern  = "{($.level = \"warn\") || ($.level = \"error\")}"
      + id              = (known after apply)
      + name            = "dql_consumer_log_stream"
      + role_arn        = (known after apply)
    }

  # aws_cloudwatch_log_subscription_filter.forms_app_log_stream will be created
  + resource "aws_cloudwatch_log_subscription_filter" "forms_app_log_stream" {
      + destination_arn = (known after apply)
      + distribution    = "ByLogStream"
      + filter_pattern  = "{($.level = \"warn\") || ($.level = \"error\")}"
      + id              = (known after apply)
      + log_group_name  = "Forms"
      + name            = "forms_app_log_stream"
      + role_arn        = (known after apply)
    }

  # aws_cloudwatch_log_subscription_filter.forms_unhandled_error_steam will be created
  + resource "aws_cloudwatch_log_subscription_filter" "forms_unhandled_error_steam" {
      + destination_arn = (known after apply)
      + distribution    = "ByLogStream"
      + filter_pattern  = "Error -level"
      + id              = (known after apply)
      + log_group_name  = "Forms"
      + name            = "forms_unhandled_error_stream"
      + role_arn        = (known after apply)
    }

  # aws_cloudwatch_log_subscription_filter.nagware_log_stream will be created
  + resource "aws_cloudwatch_log_subscription_filter" "nagware_log_stream" {
      + destination_arn = (known after apply)
      + distribution    = "ByLogStream"
      + filter_pattern  = "{($.level = \"warn\") || ($.level = \"error\")}"
      + id              = (known after apply)
      + name            = "nagware_log_stream"
      + role_arn        = (known after apply)
    }

  # aws_cloudwatch_log_subscription_filter.reliability_log_stream will be created
  + resource "aws_cloudwatch_log_subscription_filter" "reliability_log_stream" {
      + destination_arn = (known after apply)
      + distribution    = "ByLogStream"
      + filter_pattern  = "{($.level = \"warn\") || ($.level = \"error\")}"
      + id              = (known after apply)
      + log_group_name  = "/aws/lambda/Reliability"
      + name            = "reliability_log_stream"
      + role_arn        = (known after apply)
    }

  # aws_cloudwatch_log_subscription_filter.template_archiver_log_stream will be created
  + resource "aws_cloudwatch_log_subscription_filter" "template_archiver_log_stream" {
      + destination_arn = (known after apply)
      + distribution    = "ByLogStream"
      + filter_pattern  = "{($.level = \"warn\") || ($.level = \"error\")}"
      + id              = (known after apply)
      + name            = "template_archiver_log_stream"
      + role_arn        = (known after apply)
    }

  # aws_cloudwatch_metric_alarm.application_error_warn will be destroyed
  # (because aws_cloudwatch_metric_alarm.application_error_warn is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "application_error_warn" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:ca-central-1:687401027353:alert-warning",
        ] -> null
      - alarm_description         = "End User Forms Warning - An error message was detected in the ECS logs" -> null
      - alarm_name                = "ApplicationErrorWarn" -> null
      - arn                       = "arn:aws:cloudwatch:ca-central-1:687401027353:alarm:ApplicationErrorWarn" -> null
      - comparison_operator       = "GreaterThanThreshold" -> null
      - datapoints_to_alarm       = 0 -> null
      - dimensions                = {} -> null
      - evaluation_periods        = 1 -> null
      - id                        = "ApplicationErrorWarn" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "ApplicationError" -> null
      - namespace                 = "forms" -> null
      - ok_actions                = [] -> null
      - period                    = 60 -> null
      - statistic                 = "Sum" -> null
      - tags                      = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null
      - tags_all                  = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null
      - threshold                 = 0 -> null
      - treat_missing_data        = "notBreaching" -> null
    }

  # aws_cloudwatch_metric_alarm.expired_bearer_token will be destroyed
  # (because aws_cloudwatch_metric_alarm.expired_bearer_token is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "expired_bearer_token" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:ca-central-1:687401027353:alert-warning",
        ] -> null
      - alarm_description         = "End User Forms Warning - An expired bearer token has been used" -> null
      - alarm_name                = "ExpiredBearerToken" -> null
      - arn                       = "arn:aws:cloudwatch:ca-central-1:687401027353:alarm:ExpiredBearerToken" -> null
      - comparison_operator       = "GreaterThanThreshold" -> null
      - datapoints_to_alarm       = 0 -> null
      - dimensions                = {} -> null
      - evaluation_periods        = 1 -> null
      - id                        = "ExpiredBearerToken" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "ExpiredBearerToken" -> null
      - namespace                 = "forms" -> null
      - ok_actions                = [
          - "arn:aws:sns:ca-central-1:687401027353:alert-ok",
        ] -> null
      - period                    = 60 -> null
      - statistic                 = "SampleCount" -> null
      - tags                      = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null
      - tags_all                  = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null
      - threshold                 = 0 -> null
      - treat_missing_data        = "notBreaching" -> null
    }

  # aws_cloudwatch_metric_alarm.five_hundred_response_warn will be destroyed
  # (because aws_cloudwatch_metric_alarm.five_hundred_response_warn is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "five_hundred_response_warn" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:ca-central-1:687401027353:alert-warning",
        ] -> null
      - alarm_description         = "End User Forms Warning - A 5xx HTML error was detected coming from the Forms." -> null
      - alarm_name                = "500ResponseWarn" -> null
      - arn                       = "arn:aws:cloudwatch:ca-central-1:687401027353:alarm:500ResponseWarn" -> null
      - comparison_operator       = "GreaterThanThreshold" -> null
      - datapoints_to_alarm       = 0 -> null
      - dimensions                = {} -> null
      - evaluation_periods        = 1 -> null
      - id                        = "500ResponseWarn" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "500Response" -> null
      - namespace                 = "forms" -> null
      - ok_actions                = [] -> null
      - period                    = 60 -> null
      - statistic                 = "Sum" -> null
      - tags                      = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null
      - tags_all                  = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null
      - threshold                 = 0 -> null
      - treat_missing_data        = "notBreaching" -> null
    }

  # aws_cloudwatch_metric_alarm.generate_temporary_token_api_failure will be destroyed
  # (because aws_cloudwatch_metric_alarm.generate_temporary_token_api_failure is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "generate_temporary_token_api_failure" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:ca-central-1:687401027353:alert-warning",
        ] -> null
      - alarm_description         = "End User Forms Warning - Failed to generate temporary token too many times" -> null
      - alarm_name                = "GenerateTemporaryTokenApiFailure" -> null
      - arn                       = "arn:aws:cloudwatch:ca-central-1:687401027353:alarm:GenerateTemporaryTokenApiFailure" -> null
      - comparison_operator       = "GreaterThanThreshold" -> null
      - datapoints_to_alarm       = 0 -> null
      - dimensions                = {} -> null
      - evaluation_periods        = 1 -> null
      - id                        = "GenerateTemporaryTokenApiFailure" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "GenerateTemporaryTokenApiFailure" -> null
      - namespace                 = "forms" -> null
      - ok_actions                = [
          - "arn:aws:sns:ca-central-1:687401027353:alert-ok",
        ] -> null
      - period                    = 300 -> null
      - statistic                 = "SampleCount" -> null
      - tags                      = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null
      - tags_all                  = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null
      - threshold                 = 5 -> null
      - treat_missing_data        = "notBreaching" -> null
    }

  # aws_cloudwatch_metric_alarm.request_temporary_token_api_using_unauthorized_email_address will be destroyed
  # (because aws_cloudwatch_metric_alarm.request_temporary_token_api_using_unauthorized_email_address is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "request_temporary_token_api_using_unauthorized_email_address" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:ca-central-1:687401027353:alert-warning",
        ] -> null
      - alarm_description         = "End User Forms Warning - Someone tried to request a temporary token using an unauthorized email address" -> null
      - alarm_name                = "RequestTemporaryTokenApiUsingUnauthorizedEmailAddress" -> null
      - arn                       = "arn:aws:cloudwatch:ca-central-1:687401027353:alarm:RequestTemporaryTokenApiUsingUnauthorizedEmailAddress" -> null
      - comparison_operator       = "GreaterThanThreshold" -> null
      - datapoints_to_alarm       = 0 -> null
      - dimensions                = {} -> null
      - evaluation_periods        = 1 -> null
      - id                        = "RequestTemporaryTokenApiUsingUnauthorizedEmailAddress" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "RequestTemporaryTokenApiUsingUnauthorizedEmailAddress" -> null
      - namespace                 = "forms" -> null
      - ok_actions                = [
          - "arn:aws:sns:ca-central-1:687401027353:alert-ok",
        ] -> null
      - period                    = 60 -> null
      - statistic                 = "SampleCount" -> null
      - tags                      = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null
      - tags_all                  = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null
      - threshold                 = 0 -> null
      - treat_missing_data        = "notBreaching" -> null
    }

  # aws_cloudwatch_metric_alarm.temporary_token_generated_outside_canada_warn will be destroyed
  # (because aws_cloudwatch_metric_alarm.temporary_token_generated_outside_canada_warn is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "temporary_token_generated_outside_canada_warn" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:ca-central-1:687401027353:alert-warning",
        ] -> null
      - alarm_description         = "End User Forms Warning - A temporary token has been generated from outside Canada" -> null
      - alarm_name                = "TemporaryTokenGeneratedOutsideCanadaWarn" -> null
      - arn                       = "arn:aws:cloudwatch:ca-central-1:687401027353:alarm:TemporaryTokenGeneratedOutsideCanadaWarn" -> null
      - comparison_operator       = "GreaterThanThreshold" -> null
      - datapoints_to_alarm       = 0 -> null
      - dimensions                = {
          - "Region" = "ca-central-1"
          - "Rule"   = "TemporaryTokenGeneratedOutsideCanada"
          - "WebACL" = "GCForms"
        } -> null
      - evaluation_periods        = 1 -> null
      - id                        = "TemporaryTokenGeneratedOutsideCanadaWarn" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "CountedRequests" -> null
      - namespace                 = "AWS/WAFV2" -> null
      - ok_actions                = [
          - "arn:aws:sns:ca-central-1:687401027353:alert-ok",
        ] -> null
      - period                    = 300 -> null
      - statistic                 = "SampleCount" -> null
      - tags                      = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null
      - tags_all                  = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null
      - threshold                 = 0 -> null
      - treat_missing_data        = "notBreaching" -> null
    }

  # aws_lambda_function.notify_slack will be created
  + resource "aws_lambda_function" "notify_slack" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "/tmp/notify_slack.zip"
      + function_name                  = "NotifySlackSNS"
      + handler                        = "notify_slack.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::687401027353:role/NotifySlackLambda"
      + runtime                        = "nodejs14.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "GdvVvwAbuRQRTbbH3HDeuEAij45Imr/ZGIutpDGticg="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ENVIRONMENT"   = "Staging"
              + "SLACK_WEBHOOK" = (sensitive value)
            }
        }

      + tracing_config {
          + mode = "PassThrough"
        }
    }

  # aws_lambda_function.notify_slack_sns will be destroyed
  # (because aws_lambda_function.notify_slack_sns is not in configuration)
  - resource "aws_lambda_function" "notify_slack_sns" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:ca-central-1:687401027353:function:NotifySlackSNS" -> null
      - filename                       = "/tmp/notify_slack.zip" -> null
      - function_name                  = "NotifySlackSNS" -> null
      - handler                        = "notify_slack.handler" -> null
      - id                             = "NotifySlackSNS" -> null
      - invoke_arn                     = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:687401027353:function:NotifySlackSNS/invocations" -> null
      - last_modified                  = "2021-12-17T17:27:39.963+0000" -> null
      - layers                         = [] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:ca-central-1:687401027353:function:NotifySlackSNS:$LATEST" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::687401027353:role/NotifySlackLambda" -> null
      - runtime                        = "nodejs14.x" -> null
      - source_code_hash               = "6XRQfs4IrBYOXmuSBBJW/kVNbqQQb5+/1TeXMTlyrM8=" -> null
      - source_code_size               = 1053 -> null
      - tags                           = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null
      - tags_all                       = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null
      - timeout                        = 3 -> null
      - version                        = "$LATEST" -> null

      - environment {
          - variables = {
              - "ENVIRONMENT"   = "Staging"
              - "SLACK_WEBHOOK" = (sensitive value)
            } -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # aws_lambda_permission.allow_cloudwatch_to_run_lambda will be created
  + resource "aws_lambda_permission" "allow_cloudwatch_to_run_lambda" {
      + action        = "lambda:InvokeFunction"
      + function_name = "NotifySlackSNS"
      + id            = (known after apply)
      + principal     = "events.amazonaws.com"
      + source_arn    = "arn:aws:ssm:ca-central-1:687401027353:log-group:*:*"
      + statement_id  = "AllowExecutionFromCloudWatch"
    }

  # aws_sns_topic_subscription.topic_critical must be replaced
-/+ resource "aws_sns_topic_subscription" "topic_critical" {
      ~ arn                             = "arn:aws:sns:ca-central-1:687401027353:alert-critical:9eb13517-91ba-4866-9e39-6f9e190deb96" -> (known after apply)
      ~ confirmation_was_authenticated  = true -> (known after apply)
      ~ endpoint                        = "arn:aws:lambda:ca-central-1:687401027353:function:NotifySlackSNS" # forces replacement -> (known after apply)
      ~ id                              = "arn:aws:sns:ca-central-1:687401027353:alert-critical:9eb13517-91ba-4866-9e39-6f9e190deb96" -> (known after apply)
      ~ owner_id                        = "687401027353" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.topic_ok must be replaced
-/+ resource "aws_sns_topic_subscription" "topic_ok" {
      ~ arn                             = "arn:aws:sns:ca-central-1:687401027353:alert-ok:6537d517-9d16-4f1f-9aab-6f5b0953a91d" -> (known after apply)
      ~ confirmation_was_authenticated  = true -> (known after apply)
      ~ endpoint                        = "arn:aws:lambda:ca-central-1:687401027353:function:NotifySlackSNS" # forces replacement -> (known after apply)
      ~ id                              = "arn:aws:sns:ca-central-1:687401027353:alert-ok:6537d517-9d16-4f1f-9aab-6f5b0953a91d" -> (known after apply)
      ~ owner_id                        = "687401027353" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.topic_ok_us_east must be replaced
-/+ resource "aws_sns_topic_subscription" "topic_ok_us_east" {
      ~ arn                             = "arn:aws:sns:us-east-1:687401027353:alert-ok:a3badcf8-bda9-471b-9e74-d1d5eac9a72a" -> (known after apply)
      ~ confirmation_was_authenticated  = true -> (known after apply)
      ~ endpoint                        = "arn:aws:lambda:ca-central-1:687401027353:function:NotifySlackSNS" # forces replacement -> (known after apply)
      ~ id                              = "arn:aws:sns:us-east-1:687401027353:alert-ok:a3badcf8-bda9-471b-9e74-d1d5eac9a72a" -> (known after apply)
      ~ owner_id                        = "687401027353" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.topic_warning must be replaced
-/+ resource "aws_sns_topic_subscription" "topic_warning" {
      ~ arn                             = "arn:aws:sns:ca-central-1:687401027353:alert-warning:6953bf9d-51af-440b-a4ae-c955c152134c" -> (known after apply)
      ~ confirmation_was_authenticated  = true -> (known after apply)
      ~ endpoint                        = "arn:aws:lambda:ca-central-1:687401027353:function:NotifySlackSNS" # forces replacement -> (known after apply)
      ~ id                              = "arn:aws:sns:ca-central-1:687401027353:alert-warning:6953bf9d-51af-440b-a4ae-c955c152134c" -> (known after apply)
      ~ owner_id                        = "687401027353" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.topic_warning_us_east must be replaced
-/+ resource "aws_sns_topic_subscription" "topic_warning_us_east" {
      ~ arn                             = "arn:aws:sns:us-east-1:687401027353:alert-warning:7ef8bc25-4ce7-483f-9c80-fdb930d80b96" -> (known after apply)
      ~ confirmation_was_authenticated  = true -> (known after apply)
      ~ endpoint                        = "arn:aws:lambda:ca-central-1:687401027353:function:NotifySlackSNS" # forces replacement -> (known after apply)
      ~ id                              = "arn:aws:sns:us-east-1:687401027353:alert-warning:7ef8bc25-4ce7-483f-9c80-fdb930d80b96" -> (known after apply)
      ~ owner_id                        = "687401027353" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 16 to add, 0 to change, 17 to destroy.

Warning: Argument is deprecated

  with module.athena_bucket.aws_s3_bucket.this,
  on .terraform/modules/athena_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_versioning resource instead

(and 8 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notify_slack"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.alb_ddos"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.route53_ddos"]

20 tests, 17 passed, 3 warnings, 0 failures, 0 exceptions

```

</details>
